<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

In [12]:
df.to_numpy()

array([[-1.03026768, -0.29784489, -1.56764516,  1.00481502],
       [ 0.77269189,  0.46349731,  1.53819878, -1.19727329],
       [-0.64675187,  0.05397679, -0.31752261,  0.06641138],
       [-0.75277184,  1.23101906,  1.42684406,  0.93643582],
       [-0.4534854 , -0.05680124,  0.53127057,  1.48609654],
       [-0.3907913 ,  0.10890055,  0.12769058,  0.21419867]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.030268    0.772692   -0.646752   -0.752772   -0.453485   -0.390791
B   -0.297845    0.463497    0.053977    1.231019   -0.056801    0.108901
C   -1.567645    1.538199   -0.317523    1.426844    0.531271    0.127691
D    1.004815   -1.197273    0.066411    0.936436    1.486097    0.214199

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.004815 -1.567645 -0.297845 -1.030268
2013-01-02 -1.197273  1.538199  0.463497  0.772692
2013-01-03  0.066411 -0.317523  0.053977 -0.646752
2013-01-04  0.936436  1.426844  1.231019 -0.752772
2013-01-05  1.486097  0.531271 -0.056801 -0.453485
2013-01-06  0.214199  0.127691  0.108901 -0.390791

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-06 -0.390791  0.108901  0.127691  0.214199
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-04 -0.752772  1.231019  1.426844  0.936436

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -1.030268
2013-01-02    0.772692
2013-01-03   -0.646752
2013-01-04   -0.752772
2013-01-05   -0.453485
2013-01-06   -0.390791
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -1.030268
B   -0.297845
C   -1.567645
D    1.004815
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.030268 -0.297845
2013-01-02  0.772692  0.463497
2013-01-03 -0.646752  0.053977
2013-01-04 -0.752772  1.231019
2013-01-05 -0.453485 -0.056801
2013-01-06 -0.390791  0.108901

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.772692  0.463497
2013-01-03 -0.646752  0.053977
2013-01-04 -0.752772  1.231019

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    0.772692
B    0.463497
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-1.030267684409229

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-1.030267684409229

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A   -0.752772
B    1.231019
C    1.426844
D    0.936436
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.752772  1.231019
2013-01-05 -0.453485 -0.056801

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.772692  1.538199
2013-01-03 -0.646752 -0.317523
2013-01-05 -0.453485  0.531271

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.297845 -1.567645
2013-01-02  0.463497  1.538199
2013-01-03  0.053977 -0.317523
2013-01-04  1.231019  1.426844
2013-01-05 -0.056801  0.531271
2013-01-06  0.108901  0.127691

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

0.4634973103716335

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

0.4634973103716335

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  0.772692  0.463497  1.538199 -1.197273

In [37]:
df

                   A         B         C         D
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815
2013-01-02  0.772692  0.463497  1.538199 -1.197273
2013-01-03 -0.646752  0.053977 -0.317523  0.066411
2013-01-04 -0.752772  1.231019  1.426844  0.936436
2013-01-05 -0.453485 -0.056801  0.531271  1.486097
2013-01-06 -0.390791  0.108901  0.127691  0.214199

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  1.004815
2013-01-02  0.772692  0.463497  1.538199       NaN
2013-01-03       NaN  0.053977       NaN  0.066411
2013-01-04       NaN  1.231019  1.426844  0.936436
2013-01-05       NaN       NaN  0.531271  1.486097
2013-01-06       NaN  0.108901  0.127691  0.214199

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815    one
2013-01-02  0.772692  0.463497  1.538199 -1.197273    one
2013-01-03 -0.646752  0.053977 -0.317523  0.066411    two
2013-01-04 -0.752772  1.231019  1.426844  0.936436  three
2013-01-05 -0.453485 -0.056801  0.531271  1.486097   four
2013-01-06 -0.390791  0.108901  0.127691  0.214199  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.646752  0.053977 -0.317523  0.066411   two
2013-01-05 -0.453485 -0.056801  0.531271  1.486097  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01 -1.030268 -0.297845 -1.567645  1.004815  NaN
2013-01-02  0.772692  0.463497  1.538199 -1.197273  1.0
2013-01-03 -0.646752  0.053977 -0.317523  0.066411  2.0
2013-01-04 -0.752772  1.231019  1.426844  0.936436  3.0
2013-01-05 -0.453485 -0.056801  0.531271  1.486097  4.0
2013-01-06 -0.390791  0.108901  0.127691  0.214199  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.297845 -1.567645  1.004815  NaN
2013-01-02  0.772692  0.463497  1.538199 -1.197273  1.0
2013-01-03 -0.646752  0.053977 -0.317523  0.066411  2.0
2013-01-04 -0.752772  1.231019  1.426844  0.936436  3.0
2013-01-05 -0.453485 -0.056801  0.531271  1.486097  4.0
2013-01-06 -0.390791  0.108901  0.127691  0.214199  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.567645  1.004815  NaN
2013-01-02  0.772692  0.463497  1.538199 -1.197273  1.0
2013-01-03 -0.646752  0.053977 -0.317523  0.066411  2.0
2013-01-04 -0.752772  1.231019  1.426844  0.936436  3.0
2013-01-05 -0.453485 -0.056801  0.531271  1.486097  4.0
2013-01-06 -0.390791  0.108901  0.127691  0.214199  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.567645  5  NaN
2013-01-02  0.772692  0.463497  1.538199  5  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0
2013-01-04 -0.752772  1.231019  1.426844  5  3.0
2013-01-05 -0.453485 -0.056801  0.531271  5  4.0
2013-01-06 -0.390791  0.108901  0.127691  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.567645 -5  NaN
2013-01-02 -0.772692 -0.463497 -1.538199 -5 -1.0
2013-01-03 -0.646752 -0.053977 -0.317523 -5 -2.0
2013-01-04 -0.752772 -1.231019 -1.426844 -5 -3.0
2013-01-05 -0.453485 -0.056801 -0.531271 -5 -4.0
2013-01-06 -0.390791 -0.108901 -0.127691 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.567645  5  NaN  1.0
2013-01-02  0.772692  0.463497  1.538199  5  1.0  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0  NaN
2013-01-04 -0.752772  1.231019  1.426844  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.772692  0.463497  1.538199  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.567645  5  5.0  1.0
2013-01-02  0.772692  0.463497  1.538199  5  1.0  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0  5.0
2013-01-04 -0.752772  1.231019  1.426844  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.567645  5  NaN  1.0
2013-01-02  0.772692  0.463497  1.538199  5  1.0  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0  NaN
2013-01-04 -0.752772  1.231019  1.426844  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.567645  5  NaN
2013-01-02  0.772692  0.463497  1.538199  5  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0
2013-01-04 -0.752772  1.231019  1.426844  5  3.0
2013-01-05 -0.453485 -0.056801  0.531271  5  4.0
2013-01-06 -0.390791  0.108901  0.127691  5  5.0

In [54]:
df.mean()

A   -0.245185
B    0.300099
C    0.289806
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    0.858089
2013-01-02    1.754878
2013-01-03    1.217940
2013-01-04    1.981018
2013-01-05    1.804197
2013-01-06    1.969160
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.646752 -0.946023 -1.317523  4.0  1.0
2013-01-04 -3.752772 -1.768981 -1.573156  2.0  0.0
2013-01-05 -5.453485 -5.056801 -4.468729  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.567645  5  NaN
2013-01-02  0.772692  0.463497  1.538199  5  1.0
2013-01-03 -0.646752  0.053977 -0.317523  5  2.0
2013-01-04 -0.752772  1.231019  1.426844  5  3.0
2013-01-05 -0.453485 -0.056801  0.531271  5  4.0
2013-01-06 -0.390791  0.108901  0.127691  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.567645   5   NaN
2013-01-02  0.772692  0.463497 -0.029446  10   1.0
2013-01-03  0.125940  0.517474 -0.346969  15   3.0
2013-01-04 -0.626832  1.748493  1.079875  20   6.0
2013-01-05 -1.080317  1.691692  1.611146  25  10.0
2013-01-06 -1.471109  1.800592  1.738836  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    1.525464
B    1.287820
C    3.105844
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [62]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    6
1    1
2    4
3    5
4    0
5    2
6    1
7    4
8    6
9    4
dtype: int64

In [63]:
s.value_counts()

4    3
6    2
1    2
5    1
2    1
0    1
dtype: int64

# String Methods

In [66]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object